siscan/lost-swan-firmware/sdkconfig.defaults
# LOST Swan split-flap — documented IDF options only (CLAUDE.md: menuconfig for
# documented options).  Every line here has a reason.

CONFIG_IDF_TARGET="esp32c5"

# --- Motion: the step ISR must survive a flash-cache stall (NVS/OTA writes).
# Spec 5.2.  Without these the ISR is in flash and drops steps mid-write.
CONFIG_GPTIMER_ISR_IRAM_SAFE=y
CONFIG_GPTIMER_CTRL_FUNC_IN_IRAM=y

# --- 1 kHz motion control tick needs a 1 ms FreeRTOS tick.
CONFIG_FREERTOS_HZ=1000

# --- Console on USB-Serial-JTAG (CLAUDE.md toolchain section).
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- Flash / partitions
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- Web server (spec 10.2).  The /ws socket is the state push; without this
# esp_http_server has no WebSocket support at all.  LRU purge lets a stale
# browser tab be evicted rather than wedging the last connection slot.
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
# esp_http_server answers the WS handshake ITSELF and deliberately does not
# call the URI handler for it (httpd_uri.c: "If the request is websocket
# handshake, then do not call the uri->handler").  Without this callback there
# is no moment at which a newly connected client can be registered, so every
# push path is dead - found by the phase 3 review, and invisible to the host
# dev server, which has its own socket layer.
CONFIG_HTTPD_WS_POST_HANDSHAKE_CB_SUPPORT=y

# --- Watchdogs (spec 12).  Motion control task subscribes explicitly.
CONFIG_ESP_TASK_WDT_INIT=y

# --- C++17 for application code (CLAUDE.md).
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# MQTT (spec 10.3).  A publish issued while the broker is unreachable
# short-circuits before taking the client's API lock, instead of queuing into
# an outbox that drains at about one message a second.  The display publishes
# retained state that is re-asserted on every connect, so a message that cannot
# go now has nothing to say later.
CONFIG_MQTT_SKIP_PUBLISH_IF_DISCONNECTED=y

# Task watchdog: PANIC, not just a log line (spec 10.4).
#
# With it off, a task-WDT trip printed and carried on - so a first boot that
# HUNG never reset, and therefore never rolled back. A hang is precisely the
# failure rollback exists for, and it was the one case not covered.
#
# 30 s, not the default 5. The timeout has to clear every legitimately slow
# path or the cure is worse than the disease, and the longest is a LittleFS
# format of the 2 MB storage partition on a virgin board: ~512 sector erases
# with the flash cache off, 10-25 s, during which NO task runs - not even idle.
# ring_store::init unsubscribes the idle task across that window explicitly;
# the generous timeout is the second line of defence. 30 s still sits well
# inside the 120 s mark-valid window, so a hung image is caught and rolled back
# with time to spare.
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# NOT enabled yet, deliberately:
#   CONFIG_SPIRAM             — N8R8 has 8 MB PSRAM but nothing in Phase 1 needs
#                               it; enabling untested PSRAM only adds boot risk.
# (CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE is now ON, below - the mark-valid path
#  exists.)

# Rollback (spec 10.4).  Safe to turn on only now that the confirm path exists:
# with it on, an image that does not call esp_ota_mark_app_valid_cancel_rollback
# is reverted by the bootloader on the next reset.  The criterion is local
# invariants an OTA could plausibly have broken - NOT "boot + home", which
# cannot be satisfied in maintenance, cannot be satisfied with a disabled
# column, and is not satisfied by an unwired board.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
